Revit 2026 API

# ITemporaryGraphicsHandler Interface

---

Interface class for external server of TemporaryGraphicsHandlerService.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ITemporaryGraphicsHandler : IExternalServer
```
```vb
Public Interface ITemporaryGraphicsHandler
	Inherits IExternalServer
```
```cpp
public interface class ITemporaryGraphicsHandler : IExternalServer
```
```fsharp
type ITemporaryGraphicsHandler =
    interface
        interface IExternalServer
    end
```

The ITemporaryGraphicsHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | OnClick | Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager. |

#### Reference

Autodesk.Revit.UI Namespace